

<!DOCTYPE html>
<html lang="zh-CN" data-default-color-scheme=auto>



<head>
  <meta charset="UTF-8">

  <link rel="apple-touch-icon" sizes="76x76" href="/img/tom.png">
  <link rel="icon" href="/img/tom.png">
  

  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=5.0, shrink-to-fit=no">
  <meta http-equiv="x-ua-compatible" content="ie=edge">
  
  <meta name="theme-color" content="#2f4154">
  <meta name="author" content="Tom">
  <meta name="keywords" content="">
  
    <meta name="description" content="问题现象市场反馈一个舆情，目前发现雷柏鼠标MT760及MT760mini这两款型号鼠标，通过接收器或者有线直连插到机器上开机会自动重启，无法进入系统。 问题日志    bug 分析我们先查看日志，发现日志中指出内核panic，踩空指针了 我们先查看pc指针，pc 显示异常发生的指令地址，对应的函数和偏移 1pc : uos_report_ai_key.isra.18+0x1c&#x2F;0xf0  我们查看">
<meta property="og:type" content="article">
<meta property="og:title" content="雷柏鼠标接电脑开机自动重启">
<meta property="og:url" content="https://tomwithkernel.github.io/bug/%E9%9B%B7%E6%9F%8F%E9%BC%A0%E6%A0%87%E6%8F%92%E5%85%A5%E5%90%8E%E5%BC%80%E6%9C%BA%E9%87%8D%E5%90%AF/index.html">
<meta property="og:site_name" content="TomWithKernel&#39;s Blog">
<meta property="og:description" content="问题现象市场反馈一个舆情，目前发现雷柏鼠标MT760及MT760mini这两款型号鼠标，通过接收器或者有线直连插到机器上开机会自动重启，无法进入系统。 问题日志    bug 分析我们先查看日志，发现日志中指出内核panic，踩空指针了 我们先查看pc指针，pc 显示异常发生的指令地址，对应的函数和偏移 1pc : uos_report_ai_key.isra.18+0x1c&#x2F;0xf0  我们查看">
<meta property="og:locale" content="zh_CN">

<li><code>field-&gt;hidinput</code> &#x2F;&#x2F; 先拿到 <code>hidinput</code> 指针</li>
<li><code>field-&gt;hidinput-&gt;input</code> &#x2F;&#x2F; 再解引用 <code>input</code> 成员</li>
</ol>
<p>那我们来查看这2个函数成员的偏移</p>
<figure class="highlight shell"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br></pre></td><td class="code"><pre><code class="hljs shell"><span class="hljs-meta prompt_">#</span><span class="language-bash">gdb方法</span><br>(gdb) p (size_t)&amp;((struct hid_field *)0)-&gt;hidinput<br><span class="hljs-meta prompt_">$</span><span class="language-bash">4 = 96</span><br>(gdb) p (size_t)&amp;((struct hid_input *)0)-&gt;input<br><span class="hljs-meta prompt_">$</span><span class="language-bash">5 = 24</span><br><span class="hljs-meta prompt_"></span><br><span class="hljs-meta prompt_">#</span><span class="language-bash">pahole查看（更推荐）	<span class="hljs-built_in">sudo</span> apt install dwarves(pahole在这里面)</span><br>pahole -C hid_field drivers/hid/hid-core.o<br>struct hid_field &#123;<br>        unsigned int               physical;             /*     0     4 */<br>        unsigned int               logical;              /*     4     4 */<br>        unsigned int               application;          /*     8     4 */<br><br>        /* XXX 4 bytes hole, try to pack */<br><br>        struct hid_usage *         usage;                /*    16     8 */<br>        unsigned int               maxusage;             /*    24     4 */<br>        unsigned int               flags;                /*    28     4 */<br>        unsigned int               report_offset;        /*    32     4 */<br>        unsigned int               report_size;          /*    36     4 */<br>        unsigned int               report_count;         /*    40     4 */<br>        unsigned int               report_type;          /*    44     4 */<br>        __s32 *                    value;                /*    48     8 */<br>        __s32                      logical_minimum;      /*    56     4 */<br>        __s32                      logical_maximum;      /*    60     4 */<br>        /* --- cacheline 1 boundary (64 bytes) --- */<br>        __s32                      physical_minimum;     /*    64     4 */<br>        __s32                      physical_maximum;     /*    68     4 */<br>        __s32                      unit_exponent;        /*    72     4 */<br>        unsigned int               unit;                 /*    76     4 */<br>        struct hid_report *        report;               /*    80     8 */<br>        unsigned int               index;                /*    88     4 */<br><br>        /* XXX 4 bytes hole, try to pack */<br><br>        struct hid_input *         hidinput;             /*    96     8 */<br>        __u16                      dpad;                 /*   104     2 */<br><br>        /* size: 112, cachelines: 2, members: 21 */<br>        /* sum members: 98, holes: 2, sum holes: 8 */<br>        /* padding: 6 */<br>        /* last cacheline: 48 bytes */<br>&#125;;<br><br>pahole -C hid_input drivers/hid/hid-core.o<br>struct hid_input &#123;<br>        struct list_head           list;                 /*     0    16 */<br>        struct hid_report *        report;               /*    16     8 */<br>        struct input_dev *         input;                /*    24     8 */<br>        const char  *              name;                 /*    32     8 */<br>        bool                       registered;           /*    40     1 */<br><br>        /* XXX 7 bytes hole, try to pack */<br><br>        struct list_head           reports;              /*    48    16 */<br>        /* --- cacheline 1 boundary (64 bytes) --- */<br>        unsigned int               application;          /*    64     4 */<br><br>        /* size: 72, cachelines: 2, members: 7 */<br>        /* sum members: 61, holes: 1, sum holes: 7 */<br>        /* padding: 4 */<br>        /* last cacheline: 8 bytes */<br>&#125;;<br></code></pre></td></tr></table></figure>

<p>最后我们看到<code>struct input_dev *input; /* 24 8 */</code>刚好就是24字节偏移，也就是这里踩空指针了</p>
<p>最后修复方法：</p>
